Repository: 84000/data-translation-memory
Catalog: toh266-v3.tmx
Source language: bo
Languages: en

source: འོད་སྲུང་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་རབ་ཏུ་ཞུགས་ཏེ།
en: Kāśyapa, it is because the beings in that buddhafield have genuinely set out for unexcelled, perfect and complete awakening.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་སེ་གོལ་གཏོགས་པ་ཙམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱེད་ཅིང་ཕྱིར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་དེར་འོང་ངོ་།
en: For in the moment it takes to snap one’s fingers, many hundreds of thousands upon trillions of bodhisattvas can emerge from that buddhafield, ripen for awakening beings in as many world systems throughout the ten directions as there are grains of sand in the Ganges River, worship as many blessed buddhas, and then return to that world system.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འོད་སྲུང་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་མིང་ཇི་སྐད་བགྱི་བ་དག་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདི་ལྟ་སྟེ།
en: Mahākāśyapa now asked the Blessed One, “What are those bodhisattva-mahāsattvas’ names?”

source: སེང་གེ་རྣམ་པར་རོལ་དང་། སེང་གེ་རྣམ་པར་བསྒྱིངས་དང་། སེང་གེའི་ཏོག་དང་། སེང་གེ་རྣམ་པར་སྤྲུལ་པ་དང་། ཤིན་ཏུ་བརྟན་པའི་མཐུ་རྟུལ་དང་། རྡོ་རྗེའི་བློ་གྲོས་མཚོན་ཆ་དང་། འོད་སྲུང་དེ་ལྟ་བུ་ལ་སོགས་པ་རྟག་ཏུ་བརྩོན་འགྲུས་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་གི་མིང་གང་སུ་དག་གིས་ཐོས་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་གཟུགས་འཛིན་པ་དེའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་རྣམས་ཐོབ་པར་འགྱུར་རོ། །རིན་པོ་ཆེའི་རིགས་ཀྱང་རྗེས་སུ་ཐོབ་པར་འགྱུར་རོ།
en: The Blessed One replied, “Kāśyapa, they are Lion’s Play, Lion’s Yawn, Lion’s Pinnacle, Lion’s Emanation, Exceedingly Firm Power, Sword of Vajra Intelligence, and so forth. All those who hear any of the names of the bodhisattvas that constantly apply effort, such as these, will obtain the eighteen distinct qualities of a buddha belonging to the thus-gone one He Who Possesses a Body Adorned with All Jewels.

source: །ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་རྙེད་པར་འགྱུར་རོ།
en: They will also obtain the irreversible Dharma wheel.

source: །བསྐལ་པ་བརྒྱ་ཚང་བར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: After a full hundred eons, they will turn away from saṃsāra.”

source: །འཇིག་རྟེན་ཁམས་ནི་རིན་ཆེན་རིགས།
en: “In the world system Family of Jewels,

source: །རིགས་ཆེན་ཀུན་གྱིས་བརྒྱན་པ་སྟེ།
en: Adorned with all great families,

source: །དཔའ་བོ་དག་གིས་ཡོངས་སུ་བསྐོར།
en: Surrounded by heroes.

source: །འཇིག་རྟེན་སྒྲོན་མ་དེ་མཚན་ནི།
en: “The name of this light of the world

source: །རིན་ཆེན་ཀུན་གྱིས་འཕགས་པ་སྟེ། །རབ་ཏུ་བརྒྱན་པའི་གཟུགས་འཛིན་པ།
en: Is He Who Possesses a Body Adorned,

source: །ཆོས་ཏོག་རྒྱལ་མཚན་དྲང་སྲོང་སྟེ།
en: Exalted by All Jewels,

source: །བྱང་ཆུབ་སེམས་དཔས་ཡོངས་བསྐོར་ཅིང་།
en: The sage Victory Banner at the Pinnacle of Dharma.

source: །འདྲེན་པ་ཆོས་རྣམས་སྟོན་པ་མཛད།
en: “The guide dispenses Dharma teachings Surrounded by bodhisattvas,

source: །འཇིག་རྟེན་དུ་ནི་མ་བསྐོར་བ། །ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་བསྐོར།
en: Turning the irreversible wheel That has not been turned in the world.

source: །བསྐལ་པ་བརྒྱར་ཡང་མི་འཁོར་ཞིང་།
en: Will not, after a hundred eons, continue to cycle through saṃsāra,

source: །ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཡང་། །བླ་ན་མེད་པ་ཐོབ་པར་འགྱུར།
en: And will obtain the unexcelled, Irreversible wheel. “The Dharma kings

source: །གང་དག་གིས་ནི་མཚན་བརྗོད་པ།
en: Whose names are proclaimed,

source: །ཆོས་ཀྱི་རྒྱལ་པོ་དེ་དག་དང་། །རང་བྱུང་དག་ན་བཞུགས་པ་དང་། །འཇིག་རྟེན་དག་གི་ཁམས་ཀྱང་རུང་།
en: Whether they dwell in a self-arisen place Or in the world systems,

source: །མིང་དང་རིགས་ནི་རྣམ་པར་དག །སྤྱོད་པ་དག་ཀྱང་རྣམ་དག་པ།
en: “Have pure names and families, Pure conduct,

source: །ཆོས་ཀྱི་སྤྱན་ནི་རྣམ་པར་དག །ཆོས་རྣམས་ཀུན་ཀྱང་རྣམ་སྤྱངས་པ།
en: Pure Dharma vision, And perfect mastery over all phenomena. “There are many beings, Śāriputra,

source: །ཤེས་རབ་ལྡན་པའི་སྤྱོད་ཡུལ་གྱིས།
en: Who, with their insightful purview,

source: །བླ་ན་མེད་པའི་ཡེ་ཤེས་ལ། །སྐྱེ་བོ་མང་པོ་གང་དག་ནི། །ཤིན་ཏུ་འདོད་པའི་ཤཱ་རིའི་བུ།
en: Long for Unexcelled wisdom.

source: །གང་དག་ཕྱི་མའི་དུས་བྱུང་བ།
en: “In the future,

source: །ཤིན་ཏུ་འཇིགས་པར་གྱུར་པའི་ཚེ།
en: During fearful times,

source: །ཆོས་འདི་རབ་ཏུ་ཉན་འགྱུར་ཞིང་།
en: They will hear this Dharma teaching

source: །ཐོས་ནས་དད་པར་བྱེད་པ་ནི།
en: And have faith upon hearing it.

source: །ཐེ་ཙོམ་མེད་པར་དེ་དག་གིས།
en: “In so doing, they will have, without a doubt,

source: །ཤཱ་རིས་ང་ལ་བསྙེན་བཀུར་བྱས།
en: Honored me, Śāriputra.

source: །ཇི་ལྟར་རིན་ཆེན་རིན་ཐང་མེད།
en: Just as when a pauper feels discouraged

source: །དབུལ་པོས་མཐོང་ན་ཞུམ་གྱུར་ཏེ།
en: Upon seeing a priceless gem,

source: །གང་གིས་རིན་ཆེན་རྙེད་འགྱུར་བ།
en: Thinking it impossible for him to find a jewel

source: །དེ་ལྟའི་ནོར་ནི་ག་ལས་འོང་།
en: And come into such wealth;

source: །དེ་བཞིན་བླ་མེད་སངས་རྒྱས་ཀྱང་། །བསོད་ནམས་ཆུང་ངུས་ཐོས་ནས་ནི།
en: “Likewise, how could those with little merit

source: །མིག་ལ་གནོད་བྱེད་བློ་ཅན་རྣམས།
en: And jaded perspective

source: །དེ་དག་དད་པར་ག་ལ་འགྱུར།
en: Become filled with faith When hearing about unexcelled awakening? “Upon hearing about

source: །ནོར་དང་མཛོད་རྣམས་མང་པོ་དག །ནོར་བུ་རིན་ཆེན་ཐོས་ནས་ནི།
en: The many kinds of gems and treasuries, One should truly seek them out,

source: །ཤིན་ཏུ་བརྒྱན་པར་བྱའོ་ཞེས། །དེ་དག་ཡང་དག་ཡང་ཚོལ་ལོ།
en: Hoping to adorn oneself well with them.

source: །དེ་བཞིན་ཤེས་རབ་ཆེན་པོ་ཡང་།
en: “So it is also with great insight,

source: །སངས་རྒྱས་ཀྱི་ནི་མཚན་ཐོས་ནས། །ཇི་ལྟར་བྱང་ཆུབ་རེག་འགྱུར་ཞེས།
en: That when one hears the names of buddhas,

source: །དེ་དག་ཡོངས་སུ་ཚོལ་བར་བྱེད།
en: One should thoroughly seek them out, Expecting that this is how one will reach awakening.

source: །དམན་པའི་ལས་དང་ལྡན་པ་དང་། །སྡིག་པ་འདོད་དང་གཡོ་ཅན་དང་། །ཤེས་རབ་བསོད་ནམས་མེད་པ་ལ།
en: “Those with meager karma Who indulge in evil deeds, are deceitful, And lack merit and insight

source: །འདི་ལྟ་བུ་ཡི་ཐོས་པ་མེད།
en: Do not hear such things. “Those engrossed in desire,

source: །འདོད་ཆགས་ཀྱིས་ནི་ཆགས་གྱུར་དང་། །གཏི་མུག་གིས་ནི་རྨོངས་པའམ། །ཆགས་པས་ཟིལ་གྱིས་ནོན་པ་ལ།
en: Mired in delusion, Or overcome by attachment

source: །ང་རྒྱལ་ཅན་དང་ཁེངས་པ་དང་། །ལེ་ལོ་ཅན་དང་བློ་ཆུང་དང་། །མུ་སྟེགས་གཞན་ལ་བརྩོན་པ་ལ།
en: Lazy, have meager intelligence, And are preoccupied with other, extreme views

source: །བྱེ་བ་སྟོང་གི་ལྷ་རྣམས་ནི།
en: Then, a billion gods exclaimed: “Hail Buddha!

source: །ཀྱེ་མ་སངས་རྒྱས་ཀྱེ་མ་ཆོས།
en: Hail Dharma!

source: །ཀྱེ་མ་དགེ་འདུན་བླ་ན་མེད།
en: Hail the unexcelled Saṅgha!”

source: །དེ་ཞེས་དེ་ཚེ་སྒྲ་ཡང་སྒྲོག །མེ་ཏོག་གི་ཡང་ཆར་འབེབས་ཤིང་།
en: They also cast down a rain of flowers,

source: །སྟོང་གསུམ་འདིར་ནི་རབ་ཏུ་གཏོར།
en: Strewing them throughout the trigalactic megagalactic world system.

source: །སིལ་སྙན་བྱེ་བ་དཀྲོལ་བར་བྱེད།
en: They rang ten million cymbals,

source: །སྤོས་ཀྱིས་ས་ལ་ཆག་ཆག་བཏབ།
en: And doused the ground with perfume.

source: །ཞིང་འདི་སྣང་བར་བྱེད་ནས་ནི།
en: Having illuminated this realm,

source: །རྣམ་པ་དྲུག་ཏུ་གཡོ་བར་བྱས།
en: They caused the earth to shake in six different ways. All those In the assembly Who hear the teaching of this sūtra,

source: །མེ་ཏོག་བསགས་པ་དམ་པ་ཡི། །མདོ་སྡེ་འདི་ནི་རབ་བཤད་པ། །དེ་ན་འཁོར་སུ་གང་དག་ནི།
en: The sublime Bouquet of Flowers, Will attain unexcelled awakening;

source: །སངས་རྒྱས་མཚམས་གནས་མ་གཏོགས་པར། གང་གཞན་ཐོས་པ་ཐམས་ཅད་ནི།
en: That is, unless they live in a period between buddhas.

source: །སངས་རྒྱས་བླ་ན་མེད་པར་འགྱུར།
en: Bodhisattvas came

source: །ཕྱོགས་བཅུ་དག་ནི་ཐམས་ཅད་དུ།
en: From as many realms throughout the ten directions

source: །གང་གཱའི་བྱེ་སྙེད་ཞིང་ནས་ནི། །བྱང་ཆུབ་སེམས་དཔའ་ལྷགས་ནས་སུ།
en: As there are grains of sand in the Ganges River,

source: །མཉན་ནས་ཕྱིར་ཡང་སོ་སོར་དོང་།
en: Listened to the teaching, then disbanded.

source: །མདོ་སྡེ་འདི་ནི་བཤད་པའི་ཚེ།
en: When this sūtra was taught,

source: །དགེ་སློང་བྱེ་བ་མང་ཆད་པ།
en: Many tens of millions of monks

source: །དེ་དག་ཐམས་ཅད་དགྲ་བཅོམ་གྱུར།
en: All became arhats

source: །དེ་དག་གིས་ནི་འདྲེན་པ་མཐོང་།
en: And saw the guides.

source: །དགེ་སློང་དག་ནི་བརྒྱ་སྟོང་དང་། །དགེ་སློང་མ་ཡང་དེ་བཞིན་ཏེ།
en: A hundred thousand monks, And nuns too—

source: །སྟོང་ཕྲག་དྲུག་ཅུར་ཚང་བ་ཡིས།
en: Sixty thousand in full—

source: །དེ་ཚེ་ཆོས་ལ་བཟོད་པ་ཐོབ། །མི་སྐྱེ་བ་ཡི་ཆོས་རྣམས་ལ།
en: Attained acceptance of reality.

source: །བཟོད་པ་བླ་ན་མེད་ཐོབ་ནས།
en: Having attained unexcelled acceptance That all phenomena are unborn,

source: །དེ་དག་སངས་རྒྱས་རྣམས་བལྟ་ཞིང་།
en: They beheld the buddhas,

source: །སྲོག་ཆགས་རྣམས་ལ་ཆོས་ཀྱང་འཆད།
en: And taught the Dharma to beings.

source: །དགེ་སློང་མ་ནི་ལྔ་བརྒྱ་དང་། །དགེ་བསྙེན་མ་ནི་བཞི་བཅུ་དག །རང་རང་གི་ནི་གོས་རྣམས་ཀྱིས། །དེ་བཞིན་གཤེགས་ཀྱི་སྐུ་ལ་གསོལ།
en: Five hundred nuns And forty lay women Clothed the body of the Thus-Gone One With their own robes.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཡི་རངས་སོ།
en: When the Blessed One finished speaking, Venerable Śāriputra rejoiced.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། དགེ་སློང་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: The bodhisattva-mahāsattvas, the monks, and the world with its gods, humans, asuras, and gandharvas rejoiced and praised what the Blessed One taught.

source: །འཕགས་པ་མེ་ཏོག་གི་ཚོགས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This concludes the Noble Great Vehicle Sūtra “Bouquet of Flowers.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛྙཱ་ན་སིད་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དྷརྨ་ཏཱ་ཤཱི་ལ་སོགས་པས་ཞུ་ཆེན་བགྱིས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: This text was edited and finalized by the Indian preceptor Jñānasiddhi, the chief editor-translator Venerable Dharmatāśīla, and others.
